In [3]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
hitters_df= pd.read_csv("Hitters.csv",header= 0,na_values ="NA")

In [6]:
hitters_df.head()

,AtBat,Hits,HmRun,Runs,RBI,Walks,Years,CAtBat,CHits,CHmRun,CRuns,CRBI,CWalks,League,Division,PutOuts,Assists,Errors,Salary,NewLeague
0,293,66,1,30,29,14,1,293,66,1,30,29,14,A,E,446,33,20,NaN,A
1,315,81,7,24,38,39,14,3449,835,69,321,414,375,N,W,632,43,10,475.0,N
2,479,130,18,66,72,76,3,1624,457,63,224,266,263,A,W,880,82,14,480.0,A
3,496,141,20,65,78,37,11,5628,1575,225,828,838,354,N,E,200,11,3,500.0,N
4,321,87,10,39,42,30,2,396,101,12,48,46,33,N,E,805,40,4,91.5,N

In [8]:
#find out about the number of NA in the salary column
na_col = np.sum(pd.isnull(hitters_df['Salary']))
print ("the number of NA columns :{} ".format(na_col))

the number of NA columns :59

In [9]:
#drop the observation that contain the NA value 
Hitters_drop_na = hitters_df.dropna().reset_index(drop=True)
#double check for the number of NA value 
print ("the number of NA columns after dropping now :{}".format(Hitters_drop_na['Salary'].isnull().sum()))

the number of NA columns after dropping now :0